public class Unit1Task6 {
    public static void main(String[] args) {
        int x = 666;
        int y = 666;

        if (x > y) {
            System.out.println("Большее число " + x);
        } else if (y > x) {
            System.out.println("Большее число " + y);
        } else {
            System.out.println("Данные числа равны");
        }
    }
}

//    Даны 2 числа. Вывести большее из них.