public class Unit1Task4 {
    public static void main(String[] args) {

        int a = -111;
        int b = -8231;
        int c = -4151;
        int counter = 0;

        if (a>0) {
            counter++;
        } if (b>0) {
            counter++;
        } if (c>0) {
            counter++;
                }
        System.out.println("Количество положительных чисел - " + counter);
    }
}

//        Даны 3 целых числа. Найти количество
//        положительных чисел в исходном наборе.
